## Staging: ses_validation_dns_entries
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                                       NAME                                                                       |
|--------|--------------------------------------------------------------------------------------------------------------------------------------------------|
| add    | `aws_route53_record.notification_canada_ca_dkim_record[&quot;m2raeckpszs5h6xfta55h6g6oqilfsdc&quot;]`                                                      |
|        | `aws_route53_record.notification_canada_ca_dkim_record[&quot;njevscghzshjlnp537wl47birs6fqwb6&quot;]`                                                      |
|        | `aws_route53_record.notification_canada_ca_dkim_record[&quot;pdwp5bpdniz7y4bxnzbt7xasc6fckptw&quot;]`                                                      |
|        | `aws_route53_record.ses_custom_domain_dkim_record[&quot;custom-sending-domain.staging.notification.cdssandbox.xyz.eitid6uybyc5eiasoxvj64yeaybtkmqi&quot;]` |
|        | `aws_route53_record.ses_custom_domain_dkim_record[&quot;custom-sending-domain.staging.notification.cdssandbox.xyz.yof4o2jpi3ga3sr5p2tmbcuykpjvwdal&quot;]` |
|        | `aws_route53_record.ses_custom_domain_dkim_record[&quot;custom-sending-domain.staging.notification.cdssandbox.xyz.zvn2cunenmbqynpgsi4f6vz2d3tul4yn&quot;]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.notification_canada_ca_dkim_record["m2raeckpszs5h6xfta55h6g6oqilfsdc"] will be created
  + resource "aws_route53_record" "notification_canada_ca_dkim_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "m2raeckpszs5h6xfta55h6g6oqilfsdc._domainkey"
      + records         = [
          + "m2raeckpszs5h6xfta55h6g6oqilfsdc.dkim.amazonses.com",
        ]
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification_canada_ca_dkim_record["njevscghzshjlnp537wl47birs6fqwb6"] will be created
  + resource "aws_route53_record" "notification_canada_ca_dkim_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "njevscghzshjlnp537wl47birs6fqwb6._domainkey"
      + records         = [
          + "njevscghzshjlnp537wl47birs6fqwb6.dkim.amazonses.com",
        ]
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.notification_canada_ca_dkim_record["pdwp5bpdniz7y4bxnzbt7xasc6fckptw"] will be created
  + resource "aws_route53_record" "notification_canada_ca_dkim_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "pdwp5bpdniz7y4bxnzbt7xasc6fckptw._domainkey"
      + records         = [
          + "pdwp5bpdniz7y4bxnzbt7xasc6fckptw.dkim.amazonses.com",
        ]
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.ses_custom_domain_dkim_record["custom-sending-domain.staging.notification.cdssandbox.xyz.eitid6uybyc5eiasoxvj64yeaybtkmqi"] will be created
  + resource "aws_route53_record" "ses_custom_domain_dkim_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "eitid6uybyc5eiasoxvj64yeaybtkmqi._domainkey"
      + records         = [
          + "eitid6uybyc5eiasoxvj64yeaybtkmqi.dkim.amazonses.com",
        ]
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.ses_custom_domain_dkim_record["custom-sending-domain.staging.notification.cdssandbox.xyz.yof4o2jpi3ga3sr5p2tmbcuykpjvwdal"] will be created
  + resource "aws_route53_record" "ses_custom_domain_dkim_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "yof4o2jpi3ga3sr5p2tmbcuykpjvwdal._domainkey"
      + records         = [
          + "yof4o2jpi3ga3sr5p2tmbcuykpjvwdal.dkim.amazonses.com",
        ]
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.ses_custom_domain_dkim_record["custom-sending-domain.staging.notification.cdssandbox.xyz.zvn2cunenmbqynpgsi4f6vz2d3tul4yn"] will be created
  + resource "aws_route53_record" "ses_custom_domain_dkim_record" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "zvn2cunenmbqynpgsi4f6vz2d3tul4yn._domainkey"
      + records         = [
          + "zvn2cunenmbqynpgsi4f6vz2d3tul4yn.dkim.amazonses.com",
        ]
      + ttl             = 600
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
